In [1]:
data = ['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)']

In [7]:
import pandas as pd
import re

In [6]:
df=pd.DataFrame(data)
df=df.rename({0:'Name'},axis=1)  #renaming column
#df=pd.Dataframe(data=[],columns=['Name'])  also works in naming the column
df

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry
5                                   Moran, Mr. James
6                            McCarthy, Mr. Timothy J
7                     Palsson, Master. Gosta Leonard
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                Nasser, Mrs. Nicholas (Adele Achem)

In [33]:
#to extract prefix of name
for j in range(df.shape[0]):
    text=df.Name[j]
    pattern=re.compile('M(r|s|rs|iss|aster).')
    matches=pattern.finditer(text)
    for i in matches:
        print(i)
        df['Title'][j]=i

<re.Match object; span=(8, 11), match='Mr.'>
<re.Match object; span=(9, 12), match='Mrs'>
<re.Match object; span=(11, 16), match='Miss.'>
<re.Match object; span=(10, 13), match='Mrs'>
<re.Match object; span=(7, 10), match='Mr.'>
<re.Match object; span=(7, 10), match='Mr.'>
<re.Match object; span=(10, 13), match='Mr.'>
<re.Match object; span=(9, 16), match='Master.'>
<re.Match object; span=(9, 12), match='Mrs'>
<re.Match object; span=(8, 11), match='Mrs'>

In [35]:
df['Title']=df['Name'].str.extract(pat='(\w*\s\w*)')

In [49]:
##another method__ df['Title2']=df.applymap(lambda x: re.search(r'Mr\.|Mrs\.|Miss.|Master.',str(x))[0])

In [53]:
df['Name'].apply(lambda x:x.split(" ")[1].replace(".",""))
df['Title2']=df['Name'].apply(lambda x:x.split(" ")[1].replace(".",""))
df   #another way of extracting titles

                                                Name    Title  Title2
0                            Braund, Mr. Owen Harris       Mr      Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      Mrs     Mrs
2                             Heikkinen, Miss. Laina     Miss    Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      Mrs     Mrs
4                           Allen, Mr. William Henry       Mr      Mr
5                                   Moran, Mr. James       Mr      Mr
6                            McCarthy, Mr. Timothy J       Mr      Mr
7                     Palsson, Master. Gosta Leonard   Master  Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      Mrs     Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)      Mrs     Mrs

In [55]:
df.pop('Title2')

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
5        Mr
6        Mr
7    Master
8       Mrs
9       Mrs
Name: Title2, dtype: object

In [56]:
df

                                                Name    Title
0                            Braund, Mr. Owen Harris       Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      Mrs
2                             Heikkinen, Miss. Laina     Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      Mrs
4                           Allen, Mr. William Henry       Mr
5                                   Moran, Mr. James       Mr
6                            McCarthy, Mr. Timothy J       Mr
7                     Palsson, Master. Gosta Leonard   Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)      Mrs